app/controllers/search_controller.rb

  def index
    @verses = Verse.search(params[:q], params[:page])
---
SELECT * FROM "verses" WHERE (text like '%in%' AND text like '%god%' AND text like '%/adf%') LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "verses" WHERE (text like '%god%' OR text like '%in%' OR text like '%/asdf%')