app/controllers/verses_controller.rb

SELECT * FROM "verses"
---
  def index
    @verses = Verse.all

SELECT * FROM "verses" WHERE ("verses"."id" = 1)
---
  def show
    @verse = Verse.find(params[:id])